#include <iostream>
#include <ctime>
#include <iomanip>
#include <cstdlib>
#include <string>
#include <vector>
using namespace std;
/*/
متسلسلة فيبوناتشي (Fibonacci Series).
 هاي المتسلسلة مشهورة كثير بالرياضيات وإلها تطبيقات حلوة ومرتبطة بأشياء كثيرة بالطبيعة.

شو هي متسلسلة فيبوناتشي؟
باختصار، متسلسلة فيبوناتشي هي سلسلة أرقام بتبلش بالرقمين صفر (0) و واحد (1). بعد هيك، أي رقم بيجي بالسلسلة هو عبارة عن مجموع الرقمين اللي قبله مباشرة.

الترتيب بكون زي هيك:

0,1,1,2,3,5,8,13,21,34,55,89,…
كيف بتطلع الأرقام؟

0+1=1

1+1=2

1+2=3

2+3=5

3+5=8

وهكذا...

بإيش إلها علاقة؟ (ملخص)
متسلسلة فيبوناتشي إلها علاقة بأشياء كثير، وهي مش بس أرقام مجردة، إلها علاقة بـ:

النسبة الذهبية (
ϕ
 - Golden Ratio):

هاي يمكن أهم علاقة. لما تقسم أي رقم بمتسلسلة فيبوناتشي على الرقم اللي قبله مباشرة (مثلاً 
13÷8
 أو 
55÷34
)، كل ما كبرت الأرقام، بصير الناتج أقرب وأقرب للنسبة الذهبية، اللي قيمتها تقريباً 
1.618
.

النسبة الذهبية هاي موجودة في الجمال والفن والعمارة.

الطبيعة:

رح تنصدم لما تعرف إنها موجودة بأماكن كثيرة بالطبيعة:

ترتيب بتلات (أوراق) الورد والأزهار: عدد البتلات غالباً بكون رقم فيبوناتشي (
3,5,8,13
، إلخ).

توزيع البذور في رأس دوار الشمس: طريقة ترتيب اللوالب الحلزونية اللي بتطلع من المركز بتكون أعداد متتالية من فيبوناتشي.

تفرّع أغصان الشجر: أحياناً نمط تفرّع الأغصان بتبع متسلسلة فيبوناتشي
/*/
void PrintFibonacciSeries()
{
	int arr[10];
	arr[0] = 1;
	arr[1] = 1;
	for(int i = 2; i < 10; i++)
	{
		arr[i] =  arr[i - 1] + arr[i - 2];
	}

	for(int i = 0; i < 10; i++)
	{
		cout << arr[i] << " ";
	}
}

int main()
{

	PrintFibonacciSeries();
	

	return 0;
}
