تقسيم الميموري (RAM)
1️⃣ القسم الأول

القسم الأول بيتخزن فيه الكود أو الأوامر اللي هي إنستركشنز
أو خلّينا نقول كومبايلد كود
حجمها بيكون صغير

2️⃣ القسم التاني

الجزء التاني بيتخزن فيه
static variable and global variable

بيكونوا محجوزين طيلة فترة حياة البرنامج
وحجمهم صغير أيضًا حسب ما إنت حاجز

3️⃣ Stack Memory

بعدين بييجي مكان أكبر اللي هو
Stack الميموري

اللي بيعطيك ياها Operating System
وبيخصصها للبرنامج بتاعك

بيتخزن فيه:

local variables

Functions

pointers

structures

Arrays

هو أصلاً بيكون عارف حجمهم قبل ما يعمل Run
لأن إنت محددهم
لأنهم ثابتين كأحجام في البرنامج

فهو بيحسب حجمهم
وبيديك مثلًا واحد ميجا ليهم

وما بيصير تطلب أكتر من كده

4️⃣ Heap Memory

في حالة عاوز ذاكرة أكبر من كده
لازم تقترض

إنت عاوز ذاكرة أكبر
بس مش عارفها ولا محددها من قبل ما تعمل Run

فلما تحتاج شيء Dynamic
وإنت مش عارف حجمه
بتستخدم Pointer

فـ الـ Pointer هو:

مؤشر

ومهرب ليك

ومفتاح

علشان يعملك Access على المنطقة الرابعة في الميموري

المنطقة الرابعة بنسميها Heap

وهي باقي الميموري
وهي أضعاف أضعاف
اللي بتتخصصلك للبرنامج
اللي هو الـ Stack

فإنت بتعتبرها
somehow
بطريقة ما، بطريقة أو بأخرى
باقي الميموري

يعني مثلًا لو عندك الذاكرة 16 جيجا رام

1 ميجا متخزن للبرنامج بتاعك اللي في الـ Stack
باقي الـ 16 جيجا somehow ليك

فيه Limitations
بس كبيرة يعني

فإنت تقدر تحجز
as much as you want dynamically
في الـ Runtime

المنفذ بتاعك هنا الـ Pointer
كأني سكرت عليك المصروف
بس معاك دفتر شيكات
لو عاوز تحجز من الـ Heap

كل ده تحت مظلة الميموري
اللي هي الرام
